<h1 style="color:green;">FILLING MISSING VALUES</h1>

<span style="color:#FF0000;">commands must run with 'inplace=True' for permanent changes</span>

In [35]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [36]:
data=pd.read_excel('./fill_na.xlsx')
data

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

<h3 style="color:red;">Filling a common value to all missing data</h3>

In [37]:
data.fillna(0)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07       0.0000   0.000000       0
2 2020-05-08      30.9343   0.000000   rainy
3 2020-05-09       0.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382   0.000000   sunny

<h3 style="color:red;">Adding missing data to individual columns</h3>

In [38]:
data.fillna({
'temperature':5,
'windSpeed':15,
'status':'cloudy'
})

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07       5.0000  15.000000  cloudy
2 2020-05-08      30.9343  15.000000   rainy
3 2020-05-09       5.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  15.000000   sunny

<h2 style="color:red;">We can access individual columns by an alternate way also</h2>

In [39]:
data.status.fillna('windyy')

0     sunny
1    windyy
2     rainy
3    cloudy
4     rainy
5     sunny
Name: status, dtype: object

<h2 style="color:red;">Forward fill (row)</h2>

<span style="color: #00FF00;">Forward fill is a method to forward the data from the row above the missing value.Thus all the missing value will get filled with the value above. If there are multiple missing valuesconsecutively , they will also get filled with the same value of the above available data.</span>

In [40]:
data.fillna(method='ffill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343  10.788378   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

<h2 style="color:red;">Backward fill (row)</h2>

In [41]:
data.fillna(method='bfill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343   6.889682   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

<h2 style="color:red;"> Forward fill (column)</h2>

In [42]:
data.fillna(method='ffill',axis='columns')

        date          temperature            windSpeed               status
0 2020-05-06              35.6582            10.788378                sunny
1 2020-05-07  2020-05-07 00:00:00  2020-05-07 00:00:00  2020-05-07 00:00:00
2 2020-05-08              30.9343              30.9343                rainy
3 2020-05-09  2020-05-09 00:00:00             6.889682               cloudy
4 2020-05-10              13.9082             19.01299                rainy
5 2020-05-11              23.9382              23.9382                sunny

<h2 style="color:red;">  Backward fill (column)</h2>

In [43]:
data.fillna(method='bfill',axis='columns')

        date temperature  windSpeed  status
0 2020-05-06     35.6582  10.788378   sunny
1 2020-05-07         NaT        NaT     NaT
2 2020-05-08     30.9343      rainy   rainy
3 2020-05-09    6.889682   6.889682  cloudy
4 2020-05-10     13.9082   19.01299   rainy
5 2020-05-11     23.9382      sunny   sunny

<h2 style="color:red;">Limiting the forward/backward fill</h2>

<span style="color:#FF0000;">We can limit the number of rows or columns getting filled.</span>

In [44]:
data.fillna(method='ffill',limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

<h2 style="color:red;">Filling with Pandas objects</h2>

<span style="color:#FF0000;">There are many Pandas objects like df.sum(), df.max(), etc. we can fill the missing values with
these too.</span>

In [45]:
data.fillna(data.median())

        date  temperature  windSpeed  status
0 2020-05-06     35.65820  10.788378   sunny
1 2020-05-07     27.43625  10.788378     NaN
2 2020-05-08     30.93430  10.788378   rainy
3 2020-05-09     27.43625   6.889682  cloudy
4 2020-05-10     13.90820  19.012990   rainy
5 2020-05-11     23.93820  10.788378   sunny

In [46]:
data.fillna(data.mean())

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

In [47]:
data.fillna(data.sum())

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07     104.4389  36.691050     NaN
2 2020-05-08      30.9343  36.691050   rainy
3 2020-05-09     104.4389   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  36.691050   sunny

<h2 style="color:red;">Filling for specific range of columns</h2>


<span style="color:#FF0000;">We can do filling for a specific range of column too as</span>

In [48]:
data.fillna(data.mean()['temperature':'windSpeed'])

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

<h1 style="color:red;">Interpolate missing value</h1>

<span style="color:#FF0000;">In short, interpolation is a process of determining the unknown values that lie in between the
known data points. We can interpolate missing values based on different methods. This is done
by an object in DataFrame as interpolate() . By default, interpolate() does linear interpolation.</span>

<h1 style="color:purple;">Linear interpolate</h1>

<span style="color:#FF0000;">Linear interpolation involves estimating a new value by connecting two adjacent known values
with a straight line.</span>

In [49]:
data.temperature.interpolate()

0    35.65820
1    33.29625
2    30.93430
3    22.42125
4    13.90820
5    23.93820
Name: temperature, dtype: float64

<h1 style="color:green;">Time interpolate</h1>

time-weighted interpolation only works on Series or DataFrames with a DatetimeIndex

<h3 style="color:green;">data.interpolate(method='time')</h3>

<h3 style="color:purple;">Other methods</h3>

In [50]:
data.temperature.interpolate(method='barycentric')

0    35.65820
1    39.46530
2    30.93430
3    19.32775
4    13.90820
5    23.93820
Name: temperature, dtype: float64

In [51]:
data.temperature.interpolate(method='pchip')

0    35.658200
1    34.220728
2    30.934300
3    21.496772
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [52]:
data.temperature.interpolate(method='akima')

0    35.658200
1    34.448184
2    30.934300
3    22.421250
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [53]:
data.temperature.interpolate(method='spline',order=2)

0    35.658200
1    35.076089
2    30.934300
3    20.526966
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [54]:
data.temperature.interpolate(method='polynomial',order=2)

0    35.658200
1    36.196165
2    30.934300
3    19.872606
4    13.908200
5    23.938200
Name: temperature, dtype: float64